{
	"yahtzeeScorerProject": {
		"projectName": "Yahtzee Scorer",
		"info": "This scorer allows a user to play the game against the computer tracking the score in a scoreboard object.<br>This project demonstrates my understanding of <strong>object-oriented programming</strong>, ability to code the scoring logic required for yahtzee and the commit history in github will show that I built this project using <strong>Test Driven Development</strong> - writing the tests before writing the code.<br>For this project I used <strong>GitHub Actions</strong> to create a workflow, initiating automatic unit tests to continuously ensure the quality of my code.",
		"detail": "I used pytest and Pexpect for <span>unit testing</span>, the <span>debugger</span> tool to identify errors swiftly and an <span>Agile GitHub Project Board</span> to efficiently manage tasks and break objectives into manageable chunks.<br>This helped me to keeping the project on track and deliver my goals.",
		"image": "./images/yahtzeeScorerProject-main.jpg",
		"alt": "Test Driven Development for my Yahtzee Score Calculator",
		"skills": ["Pytest", "Pexpect", "Python", "Github Actions", "Github Projects"],
		"badges": ["TDD", "OOP", "Github"],
		"github": "https://github.com/annwyl21/yahtzee",
		"primaryLink": "https://github.com/annwyl21/yahtzee",
		"seeMore": "<img class='links' src='./icons/icons8-github-60.png'>Yahtzee Repo"
	},

	"brewqueue": {
		"projectName": "BrewQueue",
		"info": "An order management system (to-do list) to manage barrista workflow.<br>Created using JavaScript, I successfully debugged critical issues, including an off-by-1 error and unpredictable card creation anomolies, using <strong>browser debugging tools</strong> to pinpoint a variable declaration oversight that JavaScript gracefully handled without explicit error, a contrast to typical Python behaviour.",
		"detail": "This was my Bootcamp project, initially designed using Lucid Chart and created on completion of the <span>JavaScript DOM</span> module.",
		"image": "./images/brewqueue-main.jpg",
		"alt": "Built to my design in LucidChart",
		"skills": ["JavaScript", "local storage", "LucidChart", "CSS", "HTML"],
		"badges": ["JavaScript", "HTML", "CSS"],
		"github": "https://github.com/annwyl21/",
		"primaryLink": "./Fulfillment/index.html",
		"seeMore": "See BrewQueue"
	},

	"heathrowHeatmaps": {
		"projectName": "Visualising Heathrow Weather",
		"info": "A series of <strong>heatmaps</strong> to visualise weather data recorded at Heathrow over the last 70 years.<br>I downloaded freely available data from the MET office into <strong>Pandas</strong> in order to create heatmaps using <strong>Matplotlib, NumPy & Seaborn</strong> libraries.<br>This project involved <strong>cleaning the data</strong>.<br>See more heatmaps in my Github Repository.",
		"detail": "An interesting puzzle that I researched and handled was the <span>Unix Epoch</span> which changed how my date data was handled.",
		"image": "./images/heathrowHeatmaps-main.jpg",
		"alt": "Heatmap displaying a decade of rainfall (total rainfall in mm)",
		"imagesArray": ["./images/heathrow_rainfall_heatmap_decade_small.jpg", "./images/heathrow_min_temp_heatmap_small.jpg", "./images/heathrow_heatmap_1950_2020_small.jpg"],
		"altArray": ["Heatmap displaying a decade of rainfall (total rainfall in mm)", "Heatmap displaying 20yrs of weather data (mean daily min temp)", "Heatmap displaying 70yrs of weather data (mean daily max temp)"],
		"more-info": ["A heatmap to show 10 years of weather data, displaying the total rainfall in mm at Heathrow Airport.", "A heatmap to show 20 years of weather data, displaying the mean daily min temperature at Heathrow Airport.", "A heatmap to show 70 years of weather data, displaying the mean daily max temperature at Heathrow Airport."],
		"skills": ["Python", "Matplotlib", "Pandas"],
		"badges": ["Python", "Data Visualisation"],
		"github": "https://github.com/annwyl21/heatmap_weather",
		"primaryLink": "https://github.com/annwyl21/heatmap_weather",
		"seeMore": "<img class='links' src='./icons/icons8-github-60.png'>Heatmap Repo"
	},

	"symptomLogger": {
		"projectName": "Symptom Tracker",
		"info": "Keeping track of symptoms and pain can be difficult for people who are ill, elderly or when remembering symptoms on behalf of someone other than yourself, e.g. a child. My symptom logger is designed to support you in this challenge.<br>My project uses a metaprompt prefix in API requests to the <strong>text-davinci-003 AI model</strong> to request an on-demand summary of user-logged & timestamped symptoms stored in a <strong>PostgreSQL database</strong>.<br>A bubbleplot illustrates the frequency of symptoms over time and throughout the day, with bubble size signifying reported pain levels.",
		"detail": "To develop this application, I acquired knowledge in <span>Natural Language Processing</span> and the <span>NLTK</span>, creating a preliminary summarizing tool to establish a benchmark for the API/<span>metaprompt development</span> and I used a <span>docker image</span> of the PostgreSQL database.",
		"image": "./images/symptomLogger-main.jpg",
		"alt": "Plot displaying symptoms over time and reported pain represented by bubble size.",
		"skills": ["AI Prompt Engineering", "API", "Python", "Docker Image", "PostgreSQL", "Matplotlib"],
		"badges": ["AI Prompt Engineering", "SQL"],
		"github": "https://github.com/annwyl21/symptom_record",
		"primaryLink": "https://github.com/annwyl21/symptom_record",
		"seeMore": "<img class='links' src='./icons/icons8-github-60.png'>Symptom Log Repo"
	},

	"debtComparisonCalculator": {
		"projectName": "Debt Comparison Calculator",
		"info": "A calculator tool to compare repayments over time of personal debt using 3 different methods of structuring debt; stack, snowball & avalanche.<br>My calculator creates 3 <strong>debt objects</strong>, for 3 given debts, and then imagines how each method could repay debt in varying time periods if the repayment amounts were lumped towards a single debt at a time.<br>On completion of this project, I created a <strong>docker image</strong>, this image is available on Dockerhub and as an <strong>Azure serverless container</strong>.",
		"detail": "This project is a demonstration of my knowledge of <span>object-oriented programming</span> and was my contribution to a team project where we created <span>flask</span> website.",
		"image": "./images/debtComparisonCalculator-main.jpg",
		"alt": "Results for 3 repayment approaches allow a comparison",
		"skills": ["Flask", "Python", "Docker Image", "Dockerhub", "Git"],
		"badges": ["OOP", "Azure Serverless Container", "Version Control"],
		"github": "https://github.com/annwyl21/debt_comparison",
		"docker": "https://hub.docker.com/r/annwyl21/debt_comparison",
		"azure": "http://debt-comparison.wittyflower-04a4021a.westus2.azurecontainerapps.io",
		"primaryLink": "http://debt-comparison.wittyflower-04a4021a.westus2.azurecontainerapps.io",
		"seeMore": "Try my debt calculator"
	},

	"rps": {
		"projectName": "Rock, Paper Scissors",
		"info": "I developed the game logic in Node.js, then integrated that into the front-end JavaScript, allowing me to debug the game logic independently of the web site. This challenge also provided the opportunity to develop my front-end skill. Here I use fun box shadows in CSS and control html elements using Javascript.<br>Many of the js skills (automatically generating the flip cards and dynamically sorting my skill badges) that I practiced on this project have helped me to develop this portfolio website.",
		"detail": "This project was a bootcamp assignment. I <span>take every opportunity</span> that I am given to learn and <span>make the absolute most of it</span> that I can in order to <span>enhance my skillset</span>.",
		"image": "./images/rps-main.jpg",
		"alt": "Enjoying the traditonal game of Rock, Paper, Scissors",
		"skills": ["JavaScript", "Node.js", "Browser Dev Tools/Debugger", "HTML", "CSS"],
		"badges": ["JavaScript", "Node.js", "HTML & CSS"],
		"github": "https://github.com/annwyl21",
		"primaryLink": "./RockPaperScissors/Assignment_5_Ellen_2of3.html",
		"seeMore": "Play Rock, Paper, Scissors"
	},

	"weatherApi": {
		"projectName": "Weather API",
		"info": "A weather forecast tool that uses weather data to determine lifestyle advice.<br>This project connects to a <strong>MET office API</strong> to retrieve weather data. The data is used to create a <strong>weather object</strong> that has a <strong>method</strong> to convert celsius into fahrenheit and the to populate the fields in a <strong>flask</strong> app. I enjoy the challenge of connecting things together and making them work.",
		"detail": "This was a fun early project that taught me about sensible <span>storage of API keys</span>.",
		"image": "./images/weatherApi-main.jpg",
		"alt": "Weather Forecast Results",
		"skills": ["Flask", "API connection"],
		"badges": [" Flask", "API Connection"],
		"github": "https://github.com/annwyl21/weather_forecast",
		"primaryLink": "https://github.com/annwyl21/weather_forecast",
		"seeMore": "<img class='links' src='./icons/icons8-github-60.png'>Forecast Repo"
	},

	"sentenceTranslation": {
		"projectName": "Sentence Translation",
		"info": "I built a <strong>RESTful API</strong> to support my own language learning. I actively use Duolingo every day to learn Spanish. I built this project as a tool to support my learning and translate sentences as I needed them while reading.<br>This project takes user input on a very simple HTML page and connects to the <strong>Azure Cognitive API</strong>. The API identifies the language in which the data was entered and returns a translation in 5 given languages.<br>The 5 languages into which the sentence is translated by <strong>'Translator Susan'</strong> are; Spanish, Dutch, French, German and English.",
		"detail": "At the time of writing this I have a <span>926-day streak</span> of uninterrupted daily spanish practice demonstrating my <span>commitment</span> and persistence with new challenges and my passion for <span>active and engaged learning</span>.",
		"image": "./images/sentenceTranslation-main.jpg",
		"alt": "Sentence Translation App",
		"skills": ["RESTful API", "API Integration"],
		"badges": ["RESTful API", "API Integration"],
		"github": "https://github.com/annwyl21/sentence_translation",
		"primaryLink": "https://github.com/annwyl21/sentence_translation",
		"seeMore": "<img class='links' src='./icons/icons8-github-60.png'>Translation Repo"
	}
}
